# Chapter 7 Data Cleaning and Preparation

## 7.1 Handling Missing Data

In [2]:
import pandas as pd

In [4]:
import numpy as np

In [5]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [6]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [7]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [8]:
string_data[0] = None

In [9]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Data

In [10]:
from numpy import nan as NA

In [11]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [12]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In a data frame, the entire row with a missing value is dropped

In [14]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])

In [15]:
cleaned = data.dropna()

In [16]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [18]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [19]:
data[4] = NA

In [20]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [21]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [22]:
df = pd.DataFrame(np.random.randn(7,3))

In [24]:
df.iloc[:4, 1] = NA

In [26]:
df.iloc[:2, 2] = NA

In [27]:
df

          0         1         2
0 -1.503334       NaN       NaN
1 -0.531112       NaN       NaN
2  1.522794       NaN -1.573484
3  0.067065       NaN  0.952181
4 -1.641776  0.627448 -1.129586
5  1.690329  0.241696 -0.481908
6  0.324967 -1.267586 -0.956809

In [28]:
df.dropna()

          0         1         2
4 -1.641776  0.627448 -1.129586
5  1.690329  0.241696 -0.481908
6  0.324967 -1.267586 -0.956809

In [29]:
df.dropna(thresh=2)

          0         1         2
2  1.522794       NaN -1.573484
3  0.067065       NaN  0.952181
4 -1.641776  0.627448 -1.129586
5  1.690329  0.241696 -0.481908
6  0.324967 -1.267586 -0.956809

### Filling In Missing Data

In [30]:
df.fillna(0)

          0         1         2
0 -1.503334  0.000000  0.000000
1 -0.531112  0.000000  0.000000
2  1.522794  0.000000 -1.573484
3  0.067065  0.000000  0.952181
4 -1.641776  0.627448 -1.129586
5  1.690329  0.241696 -0.481908
6  0.324967 -1.267586 -0.956809

In [31]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -1.503334  0.500000  0.000000
1 -0.531112  0.500000  0.000000
2  1.522794  0.500000 -1.573484
3  0.067065  0.500000  0.952181
4 -1.641776  0.627448 -1.129586
5  1.690329  0.241696 -0.481908
6  0.324967 -1.267586 -0.956809

In [32]:
_ = df.fillna(0, inplace=True)

In [33]:
df

          0         1         2
0 -1.503334  0.000000  0.000000
1 -0.531112  0.000000  0.000000
2  1.522794  0.000000 -1.573484
3  0.067065  0.000000  0.952181
4 -1.641776  0.627448 -1.129586
5  1.690329  0.241696 -0.481908
6  0.324967 -1.267586 -0.956809

In [34]:
df = pd.DataFrame(np.random.randn(6,3))

In [36]:
df.iloc[2:, 1] = NA

In [38]:
df.iloc[4:, 2] = NA

In [39]:
df

          0         1         2
0 -0.627831  0.847198  0.416789
1  1.284186 -0.838899  1.027273
2 -0.065736       NaN  0.189539
3  2.018098       NaN  0.590244
4 -0.395861       NaN       NaN
5 -1.202178       NaN       NaN

In [40]:
df.fillna(method='ffill')

          0         1         2
0 -0.627831  0.847198  0.416789
1  1.284186 -0.838899  1.027273
2 -0.065736 -0.838899  0.189539
3  2.018098 -0.838899  0.590244
4 -0.395861 -0.838899  0.590244
5 -1.202178 -0.838899  0.590244

In [41]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.627831  0.847198  0.416789
1  1.284186 -0.838899  1.027273
2 -0.065736 -0.838899  0.189539
3  2.018098 -0.838899  0.590244
4 -0.395861       NaN  0.590244
5 -1.202178       NaN  0.590244

In [42]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [43]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 7.2 Data Transformation

### Removing Duplicates

In [44]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                    'k2': [1, 1, 2, 3, 3, 4, 4]})

In [45]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [46]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [47]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [48]:
data['v1'] = range(7)

In [49]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [50]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [51]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 
                              'Pastrami', 'corned beef', 'Bacon',
                             'pastrami', 'honey ham', 'nova lox'], 
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [52]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [53]:
meat_to_animal = {'bacon': 'pig', 'pulled pork': 'pig',
                 'pastrami': 'cow', 'corned beef': 'cow',
                 'honey ham': 'pig', 'nova lox': 'salmon'}

In [54]:
lowercased = data['food'].str.lower()

In [55]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [56]:
data['animal'] = lowercased.map(meat_to_animal)

In [57]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [59]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [60]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [61]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [62]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [63]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [64]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [66]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64